import pygame


#################################################################################################
#기본초기화 부분(반드시 해야하는 부분)
pygame.init()

#화면 크기 설정
screen_width = 480 #가로크기
screen_height = 640 #세로크기
screen = pygame.display.set_mode((screen_width,screen_height))


#화면 타이틀 설정
pygame.display.set_caption("James game") #게임 이름

#FPS
clock = pygame.time.Clock()
#################################################################################################



#################################################################################################
#1.사용자 정의(배경화면, 게임 이미지, 좌표, 속도, 폰트 등)



while True:

    dt = clock.tick(60) #r게임 회면의 초당 프렘수 설정(움직임의 부드러움 조정)

    #2. 이벤트 처리(키보드, 마우스 등)
    for event in pygame.event.get(): #어떤이벤트가 발생하였는가?
        if event.type == pygame.QUIT: #창이 닫히는 이벤트가 발생하였는가?
            pygame.quit()

    #3. 게임캐릭터 위치 정의

    #4. 충돌 처리
    
    #5. 화면에 그리기

    
    pygame.display.update() #게임화면 다시 그리기 (필수로 업데이트)


#################################################################################################